In [1]:
from My_db_connector import My_db_connector

# all methods of My_db_connector
method_list = [method for method in dir(My_db_connector) if method.startswith('__') is False]
print(method_list)

['db_close_connection', 'db_execute_query', 'db_show']

In [2]:
# establish connection with database
connector = My_db_connector("immobilier")

Connection to 'immobilier' database successful

In [3]:
# show all the tables in database
connector.db_show()

       name
0     vente
1  logement

In [4]:
# query example for this request :
# "Différence en pourcentage du prix au mètre carré entre un
#  appartement de 2 pièces et un appartement de 3 pièces."

query = "WITH t1 AS (SELECT count(date_mutation) AS count_T1, commune FROM vente \
    WHERE DATE_mutation \
    BETWEEN DATE('2020-01-01 00:00:00') \
    AND DATE('2020-04-01 00:00:00') \
    GROUP BY commune), \
    \
    t2 AS (SELECT count(DATE_mutation) \
    AS count_T2, commune FROM vente \
    WHERE date_mutation \
    BETWEEN DATE('2020-04-01 00:00:00') AND DATE('2020-07-01 00:00:00') \
    GROUP BY commune), \
    \
    SELECT count_T1, count_T2, t1.commune, round(count_T2 / count_T1,2) \
    FROM t1 inner join t2 \
    ON t1.commune = t2.commune \
    WHERE (count_T2 / count_T1)*1.0 >= 1.2"

result = connector.db_execute_query(query)
result

     count_T1  count_T2            commune  round(count_T2 / count_T1,2)
0          12        54          ABBEVILLE                           4.0
1          30        78    ABLON-SUR-SEINE                           2.0
2         132       270               AGDE                           2.0
3           6        30   AIRE-SUR-L'ADOUR                           5.0
4           6        12            ALENCON                           2.0
..        ...       ...                ...                           ...
307         6        12  VINEUIL ST FIRMIN                           2.0
308        18        72              VITRE                           4.0
309        36        84             VOIRON                           2.0
310        12        60            VOREPPE                           5.0
311         6        18    WITRY-LES-REIMS                           3.0

[312 rows x 4 columns]

In [5]:
# close connection 
connector.db_close_connection()

"Connection to 'immobilier' database closed successful"